{
	"@metadata": {
		"authors": [
			"Darth Kule",
			"Fryed-peach",
			"Purodha",
			"Shirayuki",
			"Siebrand",
			"The Evil IP address",
			"Umherirrender"
		]
	},
	"refreshspecial": "{{doc-special|RefreshSpecial}}\n{{Identical|Refresh special pages}}",
	"refreshspecial-desc": "{{desc|name=Refresh Special|url=http://www.mediawiki.org/wiki/Extension:RefreshSpecial}}",
	"refreshspecial-title": "Title of the special page Special:RefreshSpecial\n{{Identical|Refresh special pages}}",
	"refreshspecial-help": "Help displayed to the user on [[Special:RefreshSpecial]].\n\nRefers to {{msg-mw|Refreshspecial-button}}.",
	"refreshspecial-button": "Text displayed on the button on [[Special:RefreshSpecial]]. Clicking on the button refreshes the selected special pages.\n\nUsed in {{msg-mw|Refreshspecial-help}}.",
	"refreshspecial-fail": "Failure message displayed if no special pages were checked to refresh.",
	"refreshspecial-refreshing": "Text displayed in the subtitle below the actual page title once the user has pressed the \"Refresh selected\" button.\n{{Identical|Refreshing special pages}}",
	"refreshspecial-skipped": "This message indicates \"As the query is not expensive, it has been skipped\".",
	"refreshspecial-choice": "{{Identical|Refreshing special pages}}",
	"refreshspecial-js-disabled": "Displayed to users with JavaScript disabled so that they won't wonder why the \"select all pages\" checkbox isn't working properly.",
	"refreshspecial-select-all-pages": "Text displayed next to a checkbox on Special:RefreshSpecial; checking the checkbox allows to select all listed pages.",
	"refreshspecial-link-back": "Displayed on Special:RefreshSpecial after the user has pressed the \"Refresh selected\" button, at the bottom of the page.",
	"refreshspecial-none-selected": "If the user pressed the \"Refresh selected\" button without checking any of the checkboxes, this message will be displayed to him/her.",
	"refreshspecial-db-error": "Error message shown to the user if a database error is encountered while trying to do the necessary queries.",
	"refreshspecial-no-page": "If an invalid special page is encountered, this message will be displayed.",
	"refreshspecial-slave-lagged": "Displayed if a slave database server is lagging",
	"refreshspecial-reconnected": "Displayed if the connection to the database was lost for some reason but the extension was able to reconnect to it.",
	"refreshspecial-reconnecting": "Displayed if the connection to the database was lost for some reason.",
	"refreshspecial-page-result": "Displayed on Special:RefreshSpecial after the user has pressed the \"Refresh selected\" button and results were gotten from the DB.\n\nParameters:\n* $1 - limit number of rows. Default value: 1000",
	"refreshspecial-total-display": "Displayed on Special:RefreshSpecial after the user has pressed the \"Refresh selected\" button if the refreshing was done successfully. $1 is the amount of special pages refreshed, $2 is the amount of database rows touched, $3 is the time how long it took to refresh all the selected special pages and $4 is the complete time of the script run.",
	"right-refreshspecial": "{{doc-right|refreshspecial}}\n{{Identical|Refresh special pages}}"
}
